<a href="https://colab.research.google.com/github/fabioeomedeiros/Data-Science-Base/blob/main/05_Manipulacao_de_tabelas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Manipulação de Tabelas

In [8]:
import pandas as pd


dados = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/Data Science/Datas/athlete_events.csv')
print(type(dados))
dados.head()

<class 'pandas.core.frame.DataFrame'>

   ID                      Name  ...                             Event  Medal
0   1                 A Dijiang  ...       Basketball Men's Basketball    NaN
1   2                  A Lamusi  ...      Judo Men's Extra-Lightweight    NaN
2   3       Gunnar Nielsen Aaby  ...           Football Men's Football    NaN
3   4      Edgar Lindenau Aabye  ...       Tug-Of-War Men's Tug-Of-War   Gold
4   5  Christine Jacoba Aaftink  ...  Speed Skating Women's 500 metres    NaN

[5 rows x 15 columns]

### Mudando nome das colunas

In [25]:
dados.rename(columns = {'Name':'Nome',
                        'Sex':'Sexo',
                        'Age':'Idade',
                        'Height':'Altura',
                        'Weight':'Massa',
                        'Team':'País',
                        'Games':'Jogos',
                        'City':'Cidade',
                        'Year':'Ano',
                        'Season':'Temporada'}, inplace = True) #'inplace = True' : não mostra os resultados

dados.describe()

alturas = dados['Altura']
print(type(alturas))
print(alturas.describe())

<class 'pandas.core.series.Series'>
count    210945.000000
mean        175.338970
std          10.518462
min         127.000000
25%         168.000000
50%         175.000000
75%         183.000000
max         226.000000
Name: Altura, dtype: float64

In [28]:
print(dados['Medal'])
print(dados['Medal'].value_counts())

0          NaN
1          NaN
2          NaN
3         Gold
4          NaN
          ...
271111     NaN
271112     NaN
271113     NaN
271114     NaN
271115     NaN
Name: Medal, Length: 271116, dtype: object
Gold      13372
Bronze    13295
Silver    13116
Name: Medal, dtype: int64